
// const a = ['a', 'b', 'c'];
// const b = [1, 2, 3];

// const all = [...mas1, ...mas2];
// const all = mas1.concat(mas2);

// const all = `[${a}, ${[...b]}]`;
// a.push(1, 2 , 3);

// b.reverse();

// Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.
// b.push(4, 5, 6);
// console.log(b);
//  Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.
// b.unshift(4, 5, 6);
// console.log(b);

//  Дан массив ['js', 'css', 'jq']. Выведите на экран первый элемент.





//  Дан массив ['js', 'css', 'jq']. Выведите на экран последний элемент.
//  Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [1, 2, 3].

//  Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [4, 5].
//  Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5].

//  Дан массив [1, 2, 3, 4, 5]. С помощью метода splice запишите в новый массив элементы [2, 3, 4].

//  Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5].

//  Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
//  Дан массив [3, 4, 1, 2, 7]. Отсортируйте его.
//  Дан объект {js:'test', jq: 'hello', css: 'world'}. Получите массив его ключей.


// console.log(b);


// let arr = ['1', '2', '3', '4', '5', '6'];

// let result = [];

// while (arr.length > 0) {
//     let first = arr.shift();
//     let last = arr.pop();

//     let str = first + last;
//     result.push(str);
// }

// result = result.join('-');
// console.log(result);
